Hi @analytically, 

There are definitely pros and cons on marking `jobspec` as sensitive, and what @remilapeyre pointed out is a significant drawback in many cases.

[Terraform 0.14 added the capability of marking input variables as sensitive](https://www.hashicorp.com/blog/terraform-0-14-adds-the-ability-to-redact-sensitive-values-in-console-output). This allows marking `jobspec` as sensitive when needed, without having to modify the provider.

You would need to wrap `nomad_job` in a module. Something like this:

```hcl
variable "jobspec" {
  type      = string
  sensitive = true
}

resource "nomad_job" "job" {
  jobspec = var.jobspec
}
```

Then you Terraform commands will hide the jobspec:

```
  # module.sensitive_job.nomad_job.job will be created
  + resource "nomad_job" "job" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "dc1",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = (sensitive)
      + modify_index            = (known after apply)
      + name                    = "consul-register-on-update"
      + namespace               = "default"
      + region                  = (known after apply)
      + task_groups             = [
          + {
              + count   = 1
              + meta    = (known after apply)
              + name    = "echo"
              + task    = [
                  + {
                      + driver        = "docker"
                      + meta          = (known after apply)
                      + name          = "busybox-nc"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "service"
    }
```

The good thing about this is that marking `jobspec` as sensitive then becomes an opt-in action that you can use when necessary. The downside is having to create a module, but it would be a small one.

What do you think of this approach?